[{"text": "US stocks gained as President Donald Trump announced a trade deal with the United Kingdom during a news conference at the White House.\n\nThe Dow was up 650 points, or 1.59%. The broader S&P 500 gained 1.56%. The tech-heavy Nasdaq Composite rose 2%.\n\nUS stocks extended their gains as Trump struck a positive tone on upcoming trade talks with China. Stocks had initially wavered as Trump announced the US-UK trade deal, before surging higher as Trump said he expects a “good weekend” of trade talks with China.\n\nTrump also urged investors to buy stocks. “You better go out and buy stock now,” the president said. “Let me tell you, this country will be like a rocket ship that goes straight up.”\n\nWall Street is eager for tariff rates to come down, and investors will scrutinize the details of trade deals.\n\n“This does not provide the clarity necessary to lift the fog of uncertainty created by a trade war of choice.” Joe Brusuelas, chief economist for RSM, in a post on X.\n\nJay Hatfield, chief executive at Infrastructure Capital Advisors, said the US-UK trade deal looked “fairly thin” but was nonetheless a positive development.\n\nThe US dollar index, which measures the dollar’s strength against six major foreign currencies, gained 0.9%. The British pound weakened against the dollar after briefly gaining. And London’s FTSE 100 index closed lower by 0.3%.\n\nExplaining the dip, Susannah Streeter, head of money and markets at Hargreaves Lansdown, told CNN that investors view the deal as more favorable to the US than the UK.\n\n“10% tariffs are staying in place for great swathes of British exporters, but American companies selling into the UK will benefit from new cuts to duties,” she said.\n\nElsewhere, bitcoin crossed $100,000 for the first time in three months and gold prices slid 1.6%. The yellow metal is considered a haven during uncertainty.", "label": 0}, {"text": "Kyiv, Ukraine CNN —\n\nIt’s a proposal that the Kremlin can neither reject nor accept, but one that may force it into an awkward choice, revealing Russian President Vladimir Putin’s true appetite for his brutal war of choice.\n\nEurope’s leaders have grasped the nettle of whether peace talks over Ukraine can lead anywhere meaningful, to force Moscow into a pause in violence, precisely when it seems to seek to escalate assaults in the summer months ahead.\n\nIt also gives Europe’s largest army – Ukraine - just over 30 hours to prepare their frontline forces for perhaps a month of tense peace, and then hopefully weeks of serious negotiation, in which the borders of their country will be decided.\n\nUltimately, Ukraine, France, the United Kingdom, Germany and Poland faced little choice: the Trump administration’s very public loss of patience – sometimes with Moscow, but also less justifiably with Kyiv – carried the risk of the White House simply “moving on.” That could lead to the United States dropping aid to Ukraine, together with their efforts for a peaceful solution – a potential disaster for European security.\n\nThe past week’s clear enormous diplomatic lifting by French President Emmanuel Macron, UK Prime Minister Keir Starmer, and of course Ukrainian President Volodymyr Zelensky himself, has put the White House in a position where it has had to back a direct European bid to take control of the outcome of the biggest war on the continent since the 1940s.\n\nEurope is indeed forcing on Russia a proposal initially made by the US and Ukraine – the 30-day unconditional ceasefire first offered after a bilateral meeting in Saudi Arabia almost two months ago. But they are also forcing the White House to step up, monitor the truce, and then back tough consequences – Macron called them “massive sanctions” – if the initiative falls apart.\n\nBritain's Prime Minister Keir Starmer, France's President Emmanuel Macron and Ukraine's President Volodymyr Zelensky take a walk after visiting St. Sophia Cathedral,in Kyiv on May 10, 2025. Ludovic Marin/Pool via Reuters\n\nNow the Kremlin’s previous answer of “we need to talk about the nuances” is not enough. It needs to agree, dispute, or ignore the proposal. It is likely it will, as we have seen in the past, contrive a complex fudge of a response.\n\nRussia might agree to the pause, but then engineer a spike in violence it can accuse the Ukrainians of initiating. Or to dispute certain elements of the proposal – for instance, fighting back only against Ukrainian forces inside Russia’s Kursk or Belgorod regions – causing the White House to question whether they should angrily reject the Kremlin’s partial adherence to the truce. Moscow might choose to entirely ignore the proposal, and deploy their magical card of a Trump-Putin phone call to reshuffle the deck from which they’ve been dealt a difficult hand.\n\nThis is the most significant diplomatic moment of the war, perhaps the most important declaration of the conflict yet, and certainly the most important 36 hours since Putin faced a rebellion from his top aide Yevgeny Prigozhin in June 2023. Time is a serious problem: something that has to last 30 days must be built in 30 hours.\n\nGigantic questions remain for Ukraine and its allies as to how this ceasefire comes into effect. Can Kyiv order its forces to not fight back in self-defense? If the US is to monitor the truce, as Macron suggested, does it have the capabilities in place, in adequate quality and quantity, to study hundreds of miles of violent frontlines? Precise evidence of Moscow’s infractions will be key to helping Ukraine and Europe respond to the inevitable wave of Russian misinformation and recrimination that may accompany a truce.\n\nThe cost for Kyiv and Europe of the next month could be significant. Ukraine could lose ground as its troops soften their responses to Russian assaults during a ceasefire. The White House might emerge from the process and again swing back on its pendulum to a place where it believes Zelensky is the problem. Europe’s unity – on display remarkably today in Kyiv, and backed by over a dozen other countries from New Zealand to Canada – can only worsen from its current peak, especially if American support for Ukraine ebbs.\n\nBut the cost of doing nothing – as was the case in the Europe of the 1930s – was higher. Trump losing patience with perhaps the most complex item on his portfolio would likely be damaging for Kyiv, more than for Moscow. Putin having another two months to pick away at Kyiv’s frontlines would leave Zelensky facing another ghastly winter.\n\nServicemen of Special Police Battalion walk at their positions, amid Russia's attack on Ukraine, in Zaporizhzhia region, Ukraine April 29, 2025. Reuters\n\nUkraine and its European allies seek clarity from this proposal on whether Putin wants any kind of peace at all. The path they have chosen to get there is in itself unclear, and deeply fraught with potholes of Putin’s manipulation.\n\nListening to the heads of Europe’s five largest militaries in Kyiv Saturday, it appeared most had made their mind up that Putin does not want peace and won’t genuinely contemplate a month of it. These five leaders face a tricky few weeks of establishing that fact, and then the messy persuasion of Trump that he must take an even tougher position on Russia than his predecessor, Joe Biden.\n\nThe path ahead that Europe’s leaders appear to envisage is of a worsening of the war – where Putin violates a ceasefire, is hit with “massive sanctions,” and Europe must escalate its military backing for Ukraine. They do not appear to think the Kremlin wants the war to stop. The weeks ahead are designed, it seems, for a future in which they must prove to Trump he is being misled, and drag his White House permanently and irrefutably into their camp.", "label": 1}, {"text": "Ottawa CNN —\n\nThe resurrection of Canada’s Liberal Party was as close to miraculous as you can get in modern politics. Its savior: Prime Minister Mark Carney, a political rookie but also an experienced tactician and one of the world’s most highly regarded economists.\n\nBut in a farmer’s field on the eve of the election, Canada’s Conservative leader Pierre Poilievre continued to nurture a robust political movement that won the Conservative Party its largest share of the popular vote in decades.\n\nBoth leaders promised to vigorously stand up to the threat to annex Canada that came early, loudly and often from US President Donald Trump.\n\nTo meet the moment and the menace, Canadians rallied around the flag, expressing an uncommon patriotism. But they also coalesced along the country’s traditional left-right dividing lines, deepening fractures between east and west, young and old, male and female.\n\nMany Canadians voiced a need for strong leadership in the face of the American threat, but they are almost equally divided on who is best to deliver on that.\n\n“We have a guy down south talking smack about Canada, I think it’s important we have a strong leader to stand up to him, he needs to show us some respect,” one voter, Elaine Forbes, said as she walked to her Ottawa polling station Monday prepared to back Carney.\n\nIt was a similar sentiment that motivated many of Poilievre’s supporters.\n\n“You need a strong leader and you need a lot more than what’s been going on,” said Nolan Travis just before he cast his ballot in Ottawa, adding, “someone who is going to actually mean what he says.”\n\nVideo Ad Feedback Watch Mark Carney's victory speech after Canadian elections 01:47 - Source: CBC NEWS Watch Mark Carney's victory speech after Canadian elections 01:47 • CBC NEWS\n\nThe buzz word of “leadership” has left Canada’s three other national parties in the cold, all of them losing ground in the popular vote. The country’s next parliament will reflect more of a two-party system, united against Trump but divided about nearly everything else.\n\nBoth Carney and Poilievre extended a hand to each other on election night, promising to cooperate, especially when it comes to defending Canada against American expansionism.\n\n“You know, humility underscores the importance of governing as a team in cabinet and in caucus and working constructively with all parties across Parliament, of working in partnership with the provinces and the territories and with Indigenous peoples,” said Carney during his election victory speech, adding that he will be guided by such humility as he governs Canada.\n\nIn his election night speech, Poilievre pivoted to conciliatory language Canadians have not heard from him in months.\n\n“While we will do our constitutional duty of holding government to account and proposing better alternatives, we will always put Canada first as we stare down tariffs and other irresponsible threats from President Trump. Conservatives will work with the prime minister and all parties with the common goal of defending Canada’s interests and getting a new trade deal that puts these tariffs behind us while protecting our sovereignty and the Canadian people,” he said.\n\nAs reasonable as both leaders sounded in the aftermath of the vote, key party lieutenants were already sounding more combative.\n\nPierre Poilievre speaks to his supporters in Ottawa alongside his wide, Anaida, after losing Canada's election on Tuesday. Minas Panagiotakis/Getty Images\n\nConservative MP Jamil Jivani, who was reelected Monday, seemed in a fighting mood as he touted an alternative vision for Canada. “I don’t know what tomorrow holds – my focus though is on all the young people, all the parents, the moms, the dads who came to us and trusted us to offer an alternative a brighter future. We’re going to see that too, we’re going to keep fighting and when the next federal election comes around, conservatives will earn the trust of more voters and we will bring home a victory nationally,” he said Monday night in an interview with CBC News.\n\nJivani has been a close friend of US Vice President JD Vance since their years at Yale University.\n\nSean Fraser, a key Carney ally and a once and likely future Liberal cabinet minister, shot back at Poilievre, accusing him of adopting a Trumpian style of politics.\n\nBut Fraser did concede that Canadians are looking for his government to get beyond the political divide.\n\n“Canadians do not want us to continually talk about what’s wrong with the other party we may be competing against, they want us to put our ideas on the table and work together to get things done,” said Fraser in an interview with CBC News after his victory Monday.\n\nA two-party system is not the traditional makeup of Canada’s parliament, and it will be tough to navigate for Canadian leaders, especially Carney.\n\n“When we seek unity, unity grows,” proclaimed Carney on election night, but fostering that unity could prove an unprecedented challenge.", "label": 1}, {"text": "CNN —\n\nThe future of habeas corpus has been pushed into the spotlight as President Donald Trump has been involved in discussions inside his administration over potentially taking the extreme step of suspending the procedure.\n\nWhat is habeas corpus?\n\nHabeas corpus is a legal principle that allows people who believe they are being unlawfully detained or imprisoned to petition for their release in court.\n\nImmigrants and rights groups have filed habeas petitions in recent months as Trump has tried to speed up deportations as part of his immigration agenda.\n\nStill, habeas petitions are notoriously difficult to win in federal court, and it will be a challenge for most immigrants to obtain lawyers.\n\nHow serious would suspending habeas corpus be?\n\nLee Kovarsky, law professor at the University of Texas and expert on habeas corpus, said it would be a “national historical disaster.”\n\n“The executive could just detain you, and there would be no recourse,” he said. “Obviously they would do it to try to detain certain non citizens, but there’s no reason why it’s limited to them.”\n\nWhite House deputy chief of staff Stephen Miller said Friday the administration was “actively looking at” suspending habeas corpus and it “depends on whether the courts do the right thing or not.”\n\nBut the Constitution allows habeas corpus to be suspended only when “in Cases of Rebellion or Invasion the public Safety may require it.”\n\n“The Constitution makes clear that suspension of habeas corpus is to be reserved for actual rebellion or invasion posing the most dire threats to public safety. And Congress has never passed a law authorizing deportations without any court involvement, as Miller suggests,” CNN senior legal analyst and former federal prosecutor Elie Honig said.\n\nKovarsky said the reason why suspension of habeas corpus is so restricted “is precisely because it’s so severe.”\n\n“You have no right, to a court, to say that you’re being unlawfully detained. So in a way, the cash value of your substantive rights is zero if you don’t have a judge to evaluate them,” he said.\n\nWhat has the Supreme Court said about habeas corpus?\n\nThe Supreme Court issued a murky, unsigned order on April 7 allowing Trump to use the centuries-old Alien Enemies Act to speed up deportations for now while at the same time, the court said migrants subject to deportation under the act were entitled to notice and an opportunity to challenge their removal through federal habeas corpus petitions, marking a partial win for migrants.\n\nFollowing the Supreme Court’s decision, the American Civil Liberties Union filed a series of habeas lawsuits seeking to protect identified clients as well as “similarly situated” Venezuelans who could potentially be targeted under the Alien Enemies Act.\n\nThe Supreme Court also issued a rare overnight order on April 19th where a majority of justices blocked the Trump administration from deporting a group of immigrants in Texas.\n\nWhen has habeas corpus come up in other cases?\n\nHabeas corpus has been used in US courts including over issues with detaining alleged enemy combatants at Guantanamo Bay, Cuba, in recent years. The Supreme Court initially ruled in 2008 that detainees at the Guantanamo prison have the right to habeas corpus.\n\nIn one case, a federal judge ruled in 2021 that the detention of one detainee being held at the US military prison in Guantanamo Bay was unlawful. The judge granted a petition for a writ of habeas corpus to Asadullah Haroon Gul, who was accused of being a member of an extremist group.\n\nGul, whom the US went on to repatriate to Afghanistan, became the first detainee at the Guantanamo Bay prison to win a habeas petition in 10 years.\n\nAnother high-profile case related to habeas corpus involves Mahmoud Khalil, the Palestinian activist and legal permanent resident who was detained by immigration officers in March. Khali filed a habeas corpus petition to challenge the legality of his detention, and his case still faces legal challenges as he faces deportation.\n\nHas habeas corpus been suspended before?\n\nHabeas corpus has been suspended only four times in the history of the US, including by former President Abraham Lincoln during the Civil War.\n\nThe other three times include “in eleven South Carolina counties overrun by the Ku Klux Klan during Reconstruction; in two provinces of the Philippines during a 1905 insurrection; and in Hawaii after the bombing of Pearl Harbor,” according to the National Constitution Center.", "label": 1}]